Revit 2024 API
RailTagentJoinOption Enumeration
 The tangent joins of the rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailTagentJoinOption
Visual Basic
Public Enumeration RailTagentJoinOption
Visual C++
public enum class RailTagentJoinOption
Members
Member name | Description
AddVerticalOrHorizontalSegments |  Add vertical or horizontal segments.
NoConnector |  No connector.
ExtendRailsToMeet |  Extend rails to meet.
See Also
Autodesk.Revit.DB.Architecture Namespace